# CurveByPointsUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPointsUtils Class
Members See Also
---
A static class that contains methods for processing curves driven by points.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class CurveByPointsUtils : IDisposable
```

Visual Basic
---
```text
Public Class CurveByPointsUtils _
	Implements IDisposable
```

Visual C++
---
```text
public ref class CurveByPointsUtils : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CurveByPointsUtils
# See Also
CurveByPointsUtils Members
Autodesk.Revit.DB Namespace